app/Post.php

   public function getPaginateByLimit(int $limit_count = 10)
   {

    return $this->orderBy('updated_at', 'DESC')->paginate($limit_count);
---
select * from `posts` where `posts`.`deleted_at` is null order by `updated_at` desc limit 2 offset 0
select count(*) as aggregate from `posts` where `posts`.`deleted_at` is null