app/Http/Controllers/PostController.php

    public function index(Post $post)
  {
    $posts = Post::all();
---
select * from `posts` where `posts`.`deleted_at` is null

   public function store(Post $post, PostRequest $request)
  {
     $input = $request['post'];
     $post->fill($input)->save();

     $image = $request->file('image');//s3アップロード開始
     $path = Storage::disk('s3')->putFile('myprefix',$image,'public');// バケットの`myprefix`フォルダへアップロード
     $post->image=Storage::disk('s3')->url($path);      // アップロードした画像のフルパスを取得
     $post->save();
---
insert into `posts` (`title`, `detail_cafeURL`, `detail_place`, `detail_foodname`, `updated_at`, `created_at`) values ('sss', 'dd', 'dddd', 'dddd', '2021-08-29 12:15:54', '2021-08-29 12:15:54')
update `posts` set `image` = 'https://cafe-blog-image.s3.ap-northeast-1.amazonaws.com/myprefix/cUDhdo9901uiyazx2BIkepUbTsA7OUtlUQzBuJn3.jpg', `posts`.`updated_at` = '2021-08-29 12:15:54' where `id` = 2